wsdl/Service.asmx

<wsdl:definitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://tempuri.org/" targetNamespace="http://tempuri.org/" name="ServiceContractImpl" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"><wsdl:types><xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" elementFormDefault="qualified" targetNamespace="http://tempuri.org/"><xs:element name="Ping"><xs:complexType><xs:sequence/></xs:complexType></xs:element><xs:element name="PingResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" maxOccurs="1" name="PingResult" type="xs:string"/></xs:sequence></xs:complexType></xs:element></xs:schema></wsdl:types><wsdl:message name="IServiceContract_Ping_InputMessage"><wsdl:part name="parameters" element="tns:Ping"/></wsdl:message><wsdl:message name="IServiceContract_Ping_OutputMessage"><wsdl:part name="parameters" element="tns:PingResponse"/></wsdl:message><wsdl:portType name="IServiceContract"><wsdl:operation name="Ping"><wsdl:input message="tns:IServiceContract_Ping_InputMessage"/><wsdl:output message="tns:IServiceContract_Ping_OutputMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="BasicHttpBinding_IServiceContract" type="tns:IServiceContract"><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="Ping"><soap:operation soapAction="http://tempuri.org/IServiceContract/Ping" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="ServiceContractImpl"><wsdl:port name="BasicHttpBinding_IServiceContract" binding="tns:BasicHttpBinding_IServiceContract"><soap:address location="http://localhost:58902/Service.asmx"/></wsdl:port></wsdl:service></wsdl:definitions>